models/designation.wsd
@startuml

'******* CONFIGURATION ************************************************
!include style.uml.inc

'******* CLASS DEFINITION *********************************************
class Designation {
  +normativeStatus: NormativeStatus
  +absent: Boolean[0..1]
  +geographicArea: Iso3166Code[0..*]
  +sources: ConceptSource[0..*]
}

class ExpressionDesignation {
  +text: GlossaristTextElementType
  +language: Iso639ThreeCharCode
  +script: Iso15924Code[0..1]
  +pronunciation: <<BasicDocument>> LocalizedString[0..*]
  +grammarInfo: GrammarInfo[0..1]
}

class SymbolDesignation {
  +isInternational: Boolean[0..1]
}

class PrefixDesignation {
}

class SuffixDesignation {
}

class AbbreviationDesignation {
  +isInternational: Boolean[0..1]
  +abbreviationType: AbbreviationType[0..1]
}

enum AbbreviationType {
  truncation
  acronym
  initialism
}

class LetterSymbolDesignation {
  +text: <<BasicDocument>> LocalizedString
  +language: Iso639ThreeCharCode
  +script: Iso15924Code[0..1]
}

class GraphicalSymbolDesignation {
  +text: <<BasicDocument>> LocalizedString[0..1]
  +image: Image[0..1]
  +isInternational: Boolean[0..1]
}

enum NormativeStatus {
  preferred
  admitted
  deprecated
}

class GrammarInfo {
  +gender: GrammarGender[0..*]
  +isPreposition: Boolean[0..1]
  +isParticiple: Boolean[0..1]
  +isAdjective: Boolean[0..1]
  +isVerb: Boolean[0..1]
  +isAdverb: Boolean[0..1]
  +isNoun: Boolean[0..1]
}

enum GrammarGender {
  masculine
  feminine
  neuter
  common
}

enum Iso639ThreeCharCode {
}
enum Iso3166Code {
}
enum Iso15924Code {
}

class TextElement <<BasicDocument>> {
}

class GlossaristTextElement {
}

class EmptySlot {
}

class TextElementType <<BasicDocument>> {
}

class GlossaristTextElementType {
  +elements: GlossaristTextElement[0..1]
}

Designation <|-left- ExpressionDesignation
Designation <|-- SymbolDesignation
Designation <-- NormativeStatus

ExpressionDesignation <|-- PrefixDesignation
ExpressionDesignation <|-- SuffixDesignation
ExpressionDesignation <|-- AbbreviationDesignation
ExpressionDesignation <-- GrammarInfo

AbbreviationDesignation <-- AbbreviationType

SymbolDesignation <|-- LetterSymbolDesignation
SymbolDesignation <|-- GraphicalSymbolDesignation

GrammarInfo <-- GrammarGender

TextElementType <|-- GlossaristTextElementType

ExpressionDesignation <-- GlossaristTextElementType
GlossaristTextElement <|-- TextElement
GlossaristTextElement <|-- EmptySlot
GlossaristTextElementType <-- GlossaristTextElement

@enduml
